docs/site/kimura03_creat_proces_perfor_pract_inter_comput_music.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-05-29 Wed 22:02 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>kimura03_creat_proces_perfor_pract_inter_comput_music: Creative process and performance practice of interactive computer music: a performer's tale</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="../style.css" type="text/css">
</head>
<body>
<div id="content" class="content">
<h1 class="title">kimura03_creat_proces_perfor_pract_inter_comput_music: Creative process and performance practice of interactive computer music: a performer's tale</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#kimura03_creat_proces_perfor_pract_inter_comput_music">Creative process and performance practice of interactive computer music: a performer's tale</a>
<ul>
<li><a href="#orgcd43691">Foot pedal</a></li>
<li><a href="#org1242d67">One touch</a></li>
<li><a href="#orgf56e366">George Lewis</a></li>
<li><a href="#org729f3ed">External player</a></li>
<li><a href="#orgf2079e9">Flexible Time</a></li>
<li><a href="#org3ee5034">Tape</a></li>
<li><a href="#org3a05324">Acoustics</a></li>
<li><a href="#org7e30e8c">Intonation</a></li>
<li><a href="#org5d24a64">Questions for Comp</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-kimura03_creat_proces_perfor_pract_inter_comput_music" class="outline-2">
<h2 id="kimura03_creat_proces_perfor_pract_inter_comput_music">Creative process and performance practice of interactive computer music: a performer's tale</h2>
<div class="outline-text-2" id="text-kimura03_creat_proces_perfor_pract_inter_comput_music">
</div>
<div id="outline-container-orgcd43691" class="outline-3">
<h3 id="orgcd43691">Foot pedal</h3>
<div class="outline-text-3" id="text-orgcd43691">
<p>
Foot peadals are a bit of a giveaway. For some instruments it can have performance implications, like a violinst turning their head. But the audience sees the pedal and then hears the change, instead of being shocked by the change.
</p>
</div>
</div>
<div id="outline-container-org1242d67" class="outline-3">
<h3 id="org1242d67">One touch</h3>
<div class="outline-text-3" id="text-org1242d67">
<p>
She strives to have the least setup in front of an audience as possible, writing patches that make it easier to do that. She also has a computer generate a 440 sin wave as a disguised sound check to tune the instrument. She "tunes" the computer as well.
</p>
</div>
</div>
<div id="outline-container-orgf56e366" class="outline-3">
<h3 id="orgf56e366">George Lewis</h3>
<div class="outline-text-3" id="text-orgf56e366">
<p>
He claims that having the "magic button" reduces the communication between performer and program, and removes the flexibility of the performer (odd since most people talk about how being able to trigger the patch gives more freedom. He is talking about an improvisational system though)
</p>
</div>
</div>
<div id="outline-container-org729f3ed" class="outline-3">
<h3 id="org729f3ed">External player</h3>
<div class="outline-text-3" id="text-org729f3ed">
<p>
She also doesn't like having someone controlling the computer. It looks like a duo that is not a duo. The other person is just there to fill a technical role because the system is not advanced enough to go without them. 
</p>
</div>
</div>
<div id="outline-container-orgf2079e9" class="outline-3">
<h3 id="orgf2079e9">Flexible Time</h3>
<div class="outline-text-3" id="text-orgf2079e9">
<p>
Uses a flexible time system that triggers will activate within a certain interval. 
</p>
</div>
</div>
<div id="outline-container-org3ee5034" class="outline-3">
<h3 id="org3ee5034">Tape</h3>
<div class="outline-text-3" id="text-org3ee5034">
<p>
Tape is worse, that's too restricting
</p>
</div>
</div>
<div id="outline-container-org3a05324" class="outline-3">
<h3 id="org3a05324">Acoustics</h3>
<div class="outline-text-3" id="text-org3a05324">
<p>
Many performance spaces are not acoustically designed for interactive electroacoustic music. She gives and example of adjustments she had to make to her eq just by changing spaces.
</p>
</div>
</div>
<div id="outline-container-org7e30e8c" class="outline-3">
<h3 id="org7e30e8c">Intonation</h3>
<div class="outline-text-3" id="text-org7e30e8c">
<p>
Computers are often in equal temperament, and create intonation issues for performers. A truly interactive system should be able to track pitch and adjust tuning as much as we do when we play with piano. The more simple sound waves tend to highlight intonation problems more than a piano does.
</p>
</div>
</div>
<div id="outline-container-org5d24a64" class="outline-3">
<h3 id="org5d24a64">Questions for Comp</h3>
<div class="outline-text-3" id="text-org5d24a64">
<p>
When and how do you want to start playing or interacting?
When and how do you want to end the piece or the interaction?
When and how do you know you have had 'enough' of one section, and how do you measure this? By numbers of notes, repititions, or increasing amplitude, etc.
How do you define which section should be the climax or the new material?
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p><a href="sitemap.html">Site Map</a></p>
</div>
</body>
</html>
